###############################################################################################################
##########################################     Q21608 _ 상어 초등학교     #####################################
###############################################################################################################
'''
Given ) 상어초등학교에 N*N 크기의 교실이 있고 학교에 다니는 학생 수는 N*N 명이다. 학생은 1번부터 N*N번까지 번호가
        매겨져있고, 교실의 가장 
'''
import heapq
n = 3

table = [[0]*n for _ in range(n)]

dx = [0,1,0,-1]
dy = [-1,0,1,0]
def seat(lst,table):
    num,like = lst
    for i in range(n):
        for j in range(n):
            pass
    pass
q = []
a = [(1,[2,3]),(0,[1,2]),(3,[2,4]),(2,[3,3])]
heapq.heapify(a)

print(a)
print(heapq.heappop(a))
print(heapq.heappop(a))
print(heapq.heappop(a))
print(heapq.heappop(a))
